# file loading is done via command line argument
hierarchy -auto-top

# standard synthesis steps
flatten
proc; opt -full; clean
memory -bram /flow/bram.rule; opt -full
techmap; opt

# optimize and map into cell library
dfflibmap -liberty /flow/sm_cells.lib
abc -liberty /flow/sm_cells.lib -script /flow/script.abc

clean -purge

# write out design to json
write_json tmp/synth.json
