# load modules
read_verilog src/alu.v
read_verilog src/cpu.v
read_verilog src/soc.v
hierarchy -top soc

# standard synthesis steps
flatten -noscopeinfo
proc; opt -full; clean
memory -bram /flow/bram.rule; opt -full
techmap; opt

# optimize and map into cell library
dfflibmap -liberty /flow/sm_cells.lib
abc -liberty /flow/sm_cells.lib -script /flow/script.abc

clean -purge

# write out design to json
write_json tmp/soc_synth.json
